# Обращение к боту
bot_name = {'гриша','гришаня'}

# Датасет с фразами, на которые будет отвечать бот
data_set = {

'погода': 'weather сейчас скажу',
'что на улице': 'weather проверяю',
'прогноз': 'weather сейчас гляну...',
'прогноз погоды': 'weather сейчас посмотрю',

'программировать': 'vscode запускаю ви эс код',

'запусти ютуб': 'youtube сейчас запущу ютуб',
'открой ютуб': 'youtube сейчас открою ютуб',
'ютуб': 'youtube опять сериалы смотришь',

'открой браузер': 'yandex открываю браузер',
'запусти браузер': 'yandex запускаю браузер',
'яндекс': 'yandex открываю яндекс',
'браузер': 'yandex открываю браузер',
'открой яндекс': 'yandex открываю яндекс',
'запусти яндекс': 'yandex запускаю яндекс',

'отключись': 'offBot отключаюсь',

'как у тебя дела':'passive все хорошо, жду команду',
'что делаешь':'passive сижу в фоне, жду команду',
'привет':'passive приветствую',
'расскажи анекдот':'passive пора начать что-то менять, подумал Андрей и добавил в закладки статью "Как перестать откладывать жизнь на потом".',
'анекдот':'passive Помню, я как-то хотел поступить на филологический, но ихний декан почему-то был против.',
'давай анекдот':'passive Можно бесконечно долго смотреть на три вещи по цене двух, задаваясь вопросом: "Зачем я это купил?!"',
'работаешь':'passive как видишь',
'ты тут':'passive вроде да',
'что ты умеешь': 'passive я умею рассказывать анекдоты, показывать фильмы на ютубе, могу открыть браузер, смотреть погоду, и еще то, чему ты меня научишь',
'справка': 'passive я умею рассказывать анекдоты, показывать фильмы на ютубе, могу открыть браузер, смотреть погоду, и еще то, чему ты меня научишь',

}